; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 100)
	(= (value c1) 88)
	(= (value c2) 68)
	(= (value c3) 43)
	(= (value c4) 97)
	(= (value c5) 36)
	(= (value c6) 98)
	(= (value c7) 55)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 7
2. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 2 of 7
3. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 2 of 7
4. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 2 of 7
5. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 2 of 7
6. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 2 of 7
7. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 2 of 7
8. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 2 of 7
9. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 2 of 7
10. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 2 of 7
11. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 2 of 7
12. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 2 of 7
13. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 2 of 7
14. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 2 of 7
15. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 2 of 7
16. (increment c5)
   changed: (value c5) from 36 to 43
   goals met: 2 of 7
17. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 2 of 7
18. (increment c3)
   changed: (value c3) from 43 to 47
   goals met: 2 of 7
19. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 7
20. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 7
21. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 2 of 7
22. (increment c3)
   changed: (value c3) from 47 to 52
   goals met: 2 of 7
23. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 2 of 7
24. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 2 of 7
25. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 2 of 7
26. (increment c3)
   changed: (value c3) from 52 to 58
   goals met: 2 of 7
27. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 2 of 7
28. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 2 of 7
29. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 2 of 7
30. (decrement c1)
   changed: (value c1) from 88 to 85
   goals met: 2 of 7
31. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 2 of 7
32. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 2 of 7
33. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 2 of 7
34. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 2 of 7
35. (increment c3)
   changed: (value c3) from 58 to 64
   goals met: 2 of 7
36. (increment c3)
   changed: (value c3) from 64 to 70
   goals met: 3 of 7
37. (increment c2)
   changed: (value c2) from 68 to 73
   goals met: 2 of 7
38. (increment c2)
   changed: (value c2) from 73 to 78
   goals met: 2 of 7
39. (increment c3)
   changed: (value c3) from 70 to 76
   goals met: 2 of 7
40. (increment c3)
   changed: (value c3) from 76 to 82
   goals met: 3 of 7
41. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 7
42. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 7
43. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 7
44. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 7
45. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 7
46. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 7
47. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 3 of 7
48. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 3 of 7
49. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 3 of 7
50. (increment c7)
   changed: (value c7) from 55 to 61
   goals met: 3 of 7
51. (increment c7)
   changed: (value c7) from 61 to 67
   goals met: 3 of 7
52. (increment c7)
   changed: (value c7) from 67 to 73
   goals met: 3 of 7
53. (increment c7)
   changed: (value c7) from 73 to 79
   goals met: 3 of 7
54. (increment c7)
   changed: (value c7) from 79 to 85
   goals met: 3 of 7
55. (increment c7)
   changed: (value c7) from 85 to 91
   goals met: 3 of 7
56. (increment c7)
   changed: (value c7) from 91 to 97
   goals met: 3 of 7
57. (decrement c6)
   changed: (value c6) from 98 to 95
   goals met: 4 of 7
58. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 4 of 7
59. (increment c5)
   changed: (value c5) from 43 to 51
   goals met: 4 of 7
60. (increment c5)
   changed: (value c5) from 51 to 59
   goals met: 4 of 7
61. (increment c5)
   changed: (value c5) from 59 to 67
   goals met: 4 of 7
62. (increment c5)
   changed: (value c5) from 67 to 75
   goals met: 4 of 7
63. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 4 of 7
64. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 4 of 7
65. (increment c5)
   changed: (value c5) from 75 to 85
   goals met: 4 of 7
66. (increment c5)
   changed: (value c5) from 85 to 95
   goals met: 3 of 7
67. (increment c6)
   changed: (value c6) from 95 to 98
   goals met: 3 of 7
68. (decrement c4)
   changed: (value c4) from 97 to 93
   goals met: 4 of 7
69. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 4 of 7
70. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 4 of 7
71. (increment c2)
   changed: (value c2) from 78 to 83
   goals met: 3 of 7
72. (increment c1)
   changed: (value c1) from 85 to 92
   goals met: 3 of 7
73. (increment c3)
   changed: (value c3) from 82 to 88
   goals met: 4 of 7
74. (increment c2)
   changed: (value c2) from 83 to 88
   goals met: 3 of 7
75. (increment c3)
   changed: (value c3) from 88 to 94
   goals met: 3 of 7
76. (increment c4)
   changed: (value c4) from 93 to 97
   goals met: 3 of 7
77. (increment c2)
   changed: (value c2) from 88 to 93
   goals met: 4 of 7
78. (decrement c0)
   changed: (value c0) from 100 to 98
   goals met: 4 of 7
79. (decrement c0)
   changed: (value c0) from 98 to 96
   goals met: 4 of 7
80. (decrement c0)
   changed: (value c0) from 96 to 94
   goals met: 4 of 7
81. (decrement c0)
   changed: (value c0) from 94 to 92
   goals met: 4 of 7
82. (decrement c0)
   changed: (value c0) from 92 to 90
   goals met: 5 of 7
83. (decrement c4)
   changed: (value c4) from 97 to 93
   goals met: 5 of 7
84. (decrement c3)
   changed: (value c3) from 94 to 88
   goals met: 5 of 7
85. (decrement c2)
   changed: (value c2) from 93 to 88
   goals met: 4 of 7
86. (decrement c2)
   changed: (value c2) from 88 to 83
   goals met: 5 of 7
87. (decrement c1)
   changed: (value c1) from 92 to 85
   goals met: 4 of 7
88. (decrement c1)
   changed: (value c1) from 85 to 78
   goals met: 5 of 7
89. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 5 of 7
90. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 5 of 7
91. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 5 of 7
92. (decrement c0)
   changed: (value c0) from 90 to 85
   goals met: 5 of 7
93. (decrement c0)
   changed: (value c0) from 85 to 80
   goals met: 5 of 7
94. (decrement c0)
   changed: (value c0) from 80 to 75
   goals met: 6 of 7
95. (decrement c6)
   changed: (value c6) from 98 to 95
   goals met: 6 of 7
96. (decrement c5)
   changed: (value c5) from 95 to 85
   goals met: 6 of 7
97. (decrement c4)
   changed: (value c4) from 93 to 89
   goals met: 6 of 7
98. (decrement c4)
   changed: (value c4) from 89 to 85
   goals met: 5 of 7
99. (decrement c4)
   changed: (value c4) from 85 to 81
   goals met: 6 of 7
100. (decrement c3)
   changed: (value c3) from 88 to 82
   goals met: 5 of 7
101. (decrement c3)
   changed: (value c3) from 82 to 76
   goals met: 6 of 7
102. (decrement c2)
   changed: (value c2) from 83 to 78
   goals met: 5 of 7
103. (decrement c2)
   changed: (value c2) from 78 to 73
   goals met: 6 of 7
104. (decrement c1)
   changed: (value c1) from 78 to 71
   goals met: 6 of 7
105. (decrement c0)
   changed: (value c0) from 75 to 70
   goals met: 7 of 7
